Use mermaid diagram on Authorize
